# running in formal/hack_soc_task_prove/src/
read -formal hack_soc.v
read -sv dmux8way.v hack_alu.v hack_clock.v hack_cpu.v pc.v register.v spi_sram_encoder.v rom_stream_loader.v
prep -top hack_soc

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
