# running in formal/rom_stream_loader_task_cover/src/
read -formal rom_stream_loader.v
prep -top rom_stream_loader

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
