# running in formal/spi_sram_encoder_task_cover/src/
read -formal spi_sram_encoder.v
prep -top spi_sram_encoder

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
