# running in hack_soc_serial_rom_loader_task_prove/src/
read -formal hack_soc_serial_rom_loader.v
read -sv debounce.v pll_12___25_125.v uart.v hack_soc.v dmux8way.v hack_alu.v hack_clock.v hack_cpu.v pc.v register.v spi_sram_encoder.v rom_stream_loader.v video_signal_generator_640x480.v spi_video_ram_2.v vram_write_fifo.v
prep -top hack_soc_serial_rom_loader

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
